luispichio/TwinPy/ports/espressif/boards/twindimension_ep_esp32_s3_n8r2/mpconfigboard.h
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

// Micropython setup

#define MICROPY_HW_BOARD_NAME		"TwinDimension-EP-ESP32-S3-N8R2"
#define MICROPY_HW_MCU_NAME		    "ESP32S3"

#define CIRCUITPY_STATUS_LED_POWER	(&pin_GPIO40)
#define MICROPY_HW_LED_STATUS		(&pin_GPIO41)

#define CIRCUITPY_BOARD_UART		(1)
#define CIRCUITPY_BOARD_UART_PIN	{{.tx = &pin_GPIO43, .rx = &pin_GPIO44}}

// Default bus pins
#define DEFAULT_UART_BUS_RX		    (&pin_GPIO44)
#define DEFAULT_UART_BUS_TX		    (&pin_GPIO43)

// Serial over UART
#define CIRCUITPY_CONSOLE_UART_RX	DEFAULT_UART_BUS_RX
#define CIRCUITPY_CONSOLE_UART_TX	DEFAULT_UART_BUS_TX
